In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
df = pd.read_csv('walmart_cleaned.csv', encoding_errors= 'ignore')

In [5]:
# Create engine for MySQL connection
engine_mysql = create_engine("mysql+pymysql://root:new_password@localhost:3306/shivdb")

# Get the connection
with engine_mysql.connect() as connection:
    # Now write the dataframe to the table
    df.to_sql(name='walmart', con=engine_mysql, if_exists='replace', index=False)

print("Data written successfully to the database!")

Data written successfully to the database!

In [6]:
# Query to fetch all data from the walmart_dataset table
query = "SELECT count(*) as total_count FROM walmart_dataset"

# Fetch the data using pandas and SQLAlchemy engine
df_walmart = pd.read_sql(query, engine_mysql)

# Print the result
print(df_walmart.head())  # You can use .head() to view the top rows

   total_count
0         9969




**Count payment methods and number of transactions by payment method**

In [14]:
query = ''' 
SELECT 
    payment_method,
    COUNT(*) AS no_payments
FROM walmart
GROUP BY payment_method;
'''

df_walmart = pd.read_sql(query, engine_mysql)
print(df_walmart.head())

  payment_method  no_payments
0        Ewallet         3881
1           Cash         1832
2    Credit card         4256

**-- Project Question #2: Identify the highest-rated category in each branch**


**-- Display the branch, category, and avg rating**

In [33]:




query = ''' 
SELECT branch, category, avg_rating
FROM (
    SELECT 
        branch,
        category,
        round(AVG(rating),2) AS avg_rating,
        RANK() OVER(PARTITION BY branch ORDER BY AVG(rating) DESC) AS rnk
    FROM walmart
    GROUP BY branch, category
) temp
WHERE rnk = 1;
'''

df_walmart = pd.read_sql(query, engine_mysql)
print(df_walmart.head())

    branch                category  avg_rating
0  WALM001  Electronic accessories        7.45
1  WALM002      Food and beverages        8.25
2  WALM003       Sports and travel        7.50
3  WALM004      Food and beverages        9.30
4  WALM005       Health and beauty        8.37

**-- Q3: Identify the busiest day for each branch based on the number of transactions**

In [43]:

query = '''
SELECT branch, day_name, no_transactions
FROM (
    SELECT 
        branch,
        DAYNAME(date) AS day_name,
        COUNT(*) AS no_transactions,
        RANK() OVER(PARTITION BY branch ORDER BY COUNT(*) DESC) AS rnk
    FROM walmart
    GROUP BY branch, day_name
) temp
WHERE rnk = 1;
'''

df_walmart = pd.read_sql(query, engine_mysql)
display(df_walmart)

      branch   day_name  no_transactions
0    WALM001     Sunday               18
1    WALM002   Saturday               16
2    WALM003     Sunday               30
3    WALM004     Sunday               16
4    WALM005   Thursday               15
..       ...        ...              ...
117  WALM096    Tuesday               14
118  WALM097  Wednesday               15
119  WALM098  Wednesday               15
120  WALM099     Sunday               34
121  WALM100     Monday               15

[122 rows x 3 columns]

**-- Q4: Calculate the total quantity of items sold per payment method**

In [44]:
query = '''
SELECT 
    payment_method,
    SUM(quantity) AS no_qty_sold
FROM walmart
GROUP BY payment_method;

'''
df_walmart = pd.read_sql(query, engine_mysql)
display(df_walmart)

  payment_method  no_qty_sold
0        Ewallet       8932.0
1           Cash       4984.0
2    Credit card       9567.0

**-- Q5: Determine the average, minimum, and maximum rating of categories for each city**

In [45]:
query = '''
SELECT 
    city,
    category,
    MIN(rating) AS min_rating,
    MAX(rating) AS max_rating,
    AVG(rating) AS avg_rating
FROM walmart
GROUP BY city, category;


'''
df_walmart = pd.read_sql(query, engine_mysql)
display(df_walmart)

            city                category  min_rating  max_rating  avg_rating
0    San Antonio       Health and beauty         5.0         9.1    7.050000
1      Harlingen  Electronic accessories         9.6         9.6    9.600000
2    Haltom City      Home and lifestyle         3.0         9.5    6.227778
3        Bedford       Health and beauty         6.1         9.3    8.150000
4         Irving       Sports and travel         5.3         5.3    5.300000
..           ...                     ...         ...         ...         ...
508   Richardson  Electronic accessories         4.0         7.0    5.200000
509      Sherman      Home and lifestyle         3.0         7.0    4.955224
510   Texas City  Electronic accessories         3.0         7.0    4.571429
511  Port Arthur  Electronic accessories         3.0         7.0    4.500000
512      Schertz  Electronic accessories         3.0         7.0    4.714286

[513 rows x 5 columns]

**-- Q6: Determine the most common payment method for each branch**

In [47]:
query = ''' 
WITH cte AS (
    SELECT 
        branch,
        payment_method,
        COUNT(*) AS total_trans,
        RANK() OVER(PARTITION BY branch ORDER BY COUNT(*) DESC) AS rnk
    FROM walmart
    GROUP BY branch, payment_method
)
SELECT branch, payment_method AS preferred_payment_method
FROM cte
WHERE rnk = 1;
'''
df_walmart = pd.read_sql(query, engine_mysql)
display(df_walmart)

     branch preferred_payment_method
0   WALM001                  Ewallet
1   WALM002                  Ewallet
2   WALM003              Credit card
3   WALM004                  Ewallet
4   WALM005                  Ewallet
..      ...                      ...
95  WALM096                  Ewallet
96  WALM097                  Ewallet
97  WALM098                  Ewallet
98  WALM099              Credit card
99  WALM100                  Ewallet

[100 rows x 2 columns]

**-- Q8: Categorize sales into Morning, Afternoon, and Evening shifts**

In [49]:
query = ''' 
SELECT
    branch,
    CASE 
        WHEN HOUR(TIME(time)) < 12 THEN 'Morning'
        WHEN HOUR(TIME(time)) BETWEEN 12 AND 17 THEN 'Afternoon'
        ELSE 'Evening'
    END AS shift,
    COUNT(*) AS num_invoices
FROM walmart
GROUP BY branch, shift
ORDER BY branch, num_invoices DESC;
'''
df_walmart = pd.read_sql(query, engine_mysql)
display(df_walmart)

      branch      shift  num_invoices
0    WALM001  Afternoon            36
1    WALM001    Evening            30
2    WALM001    Morning             8
3    WALM002  Afternoon            29
4    WALM002    Evening            21
..       ...        ...           ...
295  WALM099    Morning            40
296  WALM099    Evening            32
297  WALM100  Afternoon            24
298  WALM100    Morning            19
299  WALM100    Evening            19

[300 rows x 3 columns]

**-- Q9: Identify the 5 branches with the highest revenue decrease ratio from last year to current year (e.g., 2022 to 2023)**

In [54]:
query = ''' 
with 
cte_1 as 
(
select branch, sum(sales) as revenue_22 
from walmart_dataset where year(str_to_date(date, '%d/%m/%YY')) = 2022 group by branch 
),  cte_2 as (
select branch, sum(sales) as revenue_23
from walmart_dataset where year(str_to_date(date, '%d/%m/%YY')) = 2023 group by branch
)
select cte_1.branch, cte_1.revenue_22, cte_2.revenue_23, 
		ROUND((cte_1.revenue_22 - cte_2.revenue_23) / cte_1.revenue_22, 2) * 100 as revenue_drop
from cte_1 join cte_2 on cte_1.branch = cte_2.branch 
where  cte_1.revenue_22 > cte_2.revenue_23  order by revenue_drop Desc limit 5;
'''

df_walmart = pd.read_sql(query, engine_mysql)
display(df_walmart)

TypeError: %d format: a real number is required, not dict